print("Hollo Word")


x = 5
print(x)

Марк Лутц
Изучаем Python, 4-е издание
Перевод А. Киселева
Главный редактор А. Галунов
Зав. редакцией Н. Макарова
Выпускающий редактор П. Щеголев
Редактор Ю. Бочина
Корректор С. Минин
Верстка К. Чубаров
Лутц М.
Изучаем Python, 4-е издание. – Пер. с англ. – СПб.: Символ-Плюс, 2011. –
1280 с., ил.
ISBN 978-5-93286-159-2
Такие известные компании, как Google и Intel, Cisco и Hewlett-Packard, используют язык Python, выбрав его за гибкость, простоту использования и обеспечиваемую им высокую скорость разработки. Он позволяет создавать эффективные
и надежные проекты, которые легко интегрируются с программами и инструментами, написанными на других языках.
Четвертое издание «Изучаем Python» – это учебник, написанный доступным
языком, рассчитанный на индивидуальную скорость обучения и основанный на
материалах учебных курсов, которые автор, Марк Лутц, ведет уже на протяжении десяти лет. Издание значительно расширено и дополнено в соответствии с изменениями, появившимися в новой версии 3.0. В книге представлены основные
типы объектов в языке Python, порядок их создания и работы с ними, а также
функции как основной процедурный элемент языка. Рассматриваются методы
работы с модулями и дополнительными объектно-ориентированными инструментами языка Python – классами. Включены описания моделей и инструкций
обработки исключений, а также обзор инструментов разработки, используемых
при создании крупных программ.
Каждая глава завершается контрольными вопросами с ответами на закрепление пройденного материала, а каждая часть – упражнениями, решения которых
приведены в приложении В. Книга была дополнена примечаниями о наиболее
существенных расширениях языка, появившихся в версии Python 3.1.
ISBN 978-5-93286-159-2
ISBN 978-0-596-15806-4 (англ)
© Издательство Символ-Плюс, 2010
Authorized translation of the English edition © 2009 O’Reilly Media Inc.. This translation is published and sold by permission of O’Reilly Media Inc., the owner of all rights
to publish and sell the same.
Все права на данное издание защищены Законодательством РФ, включая право на полное или частичное воспроизведение в любой форме. Все товарные знаки или зарегистрированные товарные знаки, упоминаемые в настоящем издании, являются собственностью соответствующих фирм.
Издательство «Символ-Плюс». 199034, Санкт-Петербург, 16 линия, 7,
тел. (812) 324-5353, www.symbol.ru. Лицензия ЛП N 000054 от 25.12.98.
Подписано в печать 22.10.2010. Формат 70×100 1/16. Печать офсетная.
Объем 80 печ. л. Тираж ХХ00 экз. Заказ №
Отпечатано с готовых диапозитивов в ГУП «Типография «Наука»
199034, Санкт-Петербург, 9 линия, 12.
Посвящается Вер
